tap "aws/tap"
tap "azure/kubelogin"
tap "iann0036/iamlive"
tap "pulumi/tap"
tap "FelixKratz/formulae"


# brew "neovim"
brew "azure-cli"
brew "direnv"
brew "act"
brew "aws-sam-cli"
brew "docutils"
brew "bat"
brew "awscli"
brew "coreutils"
brew "extract_url"
brew "libssh2"
brew "flyctl"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "grpcurl"
brew "jq"
brew "krb5"
brew "libpq"
brew "zstd"
brew "nmap"
brew "pinentry-mac"
brew "ripsecrets"
brew "starship"
brew "step"
brew "telnet"
brew "tree-sitter"
brew "iann0036/iamlive/iamlive"
brew "pulumi/tap/pulumictl"
brew "luarocks"
cask "rar"
cask "transmission"
brew "transmission-cli"
cask "vlc"
brew "zoxide"
brew "yq"
brew "gnu-sed"
brew "gnu-tar"

# OS
brew "sketchybar"
cask "firefox@developer-edition"
cask "utm"
tap "nikitabobko/tap"
cask "aerospace"
cask "balenaetcher"

# Apps
cask "gimp"

# garbage
brew "python@3.11"
brew "python@3.10"

# development
brew "lua-language-server"
brew "lua"
brew "deno"
brew "node"
brew "make"
brew "protobuf"
brew "tailwindcss"
brew "k6"
brew "kiota"
tap "bufbuild/buf"
brew "bufbuild/buf/buf"
# Rust
tap "cargo-lambda/cargo-lambda"
tap "messense/macos-cross-toolchains"
brew "cargo-lambda/cargo-lambda/cargo-lambda"
brew "cargo-nextest"
# Go
tap "golangci/tap"
tap "goreleaser/tap"
brew "go"
brew "golangci-lint"
brew "gopls"
brew "goreleaser"
brew "go-task"
brew "gotestsum"
brew "templ"
brew "mockery"
brew "staticcheck"

# containers
brew "docker-completion"
brew "docker-slim"
brew "qemu"
brew "whalebrew"
brew "Azure/kubelogin/kubelogin"
brew "kubectl"
brew "kind"
brew "k9s"
brew "kustomize"
brew "cilium-cli"
brew "sops"
brew "helm"
cask "gcloud-cli"
brew "cyphernetes"
brew "crossplane"
brew "kubebuilder"
tap "siderolabs/tap"
brew "talosctl"
brew "ko"
brew "kyverno"

# terminal
brew "nushell"
#cask "wezterm@nightly"
cask "ghostty"
brew "ripgrep"
brew "tree"
brew "watch"
brew "wget"
brew "zsh"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "lazygit"
brew "entr"
brew "jj"

# LLM
brew "ollama" 
cask "mochi-diffusion"

# Infra
cask "raspberry-pi-imager"
brew "mkcert"
brew "sniffnet"
