tap "aws/tap"
tap "azure/kubelogin"
tap "homebrew/bundle"
tap "iann0036/iamlive"
tap "pulumi/tap"

brew "neovim"
brew "azure-cli"
brew "direnv"
brew "docker"
brew "docker-completion"
brew "docker-slim"
brew "act"
brew "aws-sam-cli"
brew "docutils"
brew "bat"
brew "awscli"
brew "coreutils"
brew "extract_url"
brew "libssh2"
brew "flyctl"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "grpcurl"
brew "jq"
brew "krb5"
brew "libpq"
brew "zstd"
brew "nmap"
brew "pinentry-mac"
brew "pulumi"
brew "qemu"
brew "ripsecrets"
brew "starship"
brew "step"
brew "telnet"
brew "transmission-cli"
brew "tree-sitter"
brew "whalebrew"
brew "iann0036/iamlive/iamlive"
brew "pulumi/tap/pulumictl"
cask "rar"
cask "transmission"
cask "vlc"

# garbage
brew "python@3.11"
brew "python@3.10"

# development
tap "bufbuild/buf"
tap "cargo-lambda/cargo-lambda"
tap "golangci/tap"
tap "goreleaser/tap"
tap "messense/macos-cross-toolchains"
brew "bufbuild/buf/buf"
brew "cargo-lambda/cargo-lambda/cargo-lambda"
brew "cargo-nextest"
brew "deno"
brew "go"
brew "golangci-lint"
brew "gopls"
brew "goreleaser"
brew "go-task"
brew "node"
brew "lua-language-server"
brew "make"
brew "protobuf"

# kubernetes
brew "Azure/kubelogin/kubelogin"
brew "kubectl"
brew "kind"
brew "k9s"
brew "kustomize"
brew "cilium-cli"

# terminal
cask "wezterm"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "zsh"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "lazygit"

# utils
brew "entr"

# LLM
brew "ollama" 
